[
    {
        "Name": "Scott Pilgrim",
        "ActorActress": "Micheal Cera",
        "Description": "Scott William Pilgrim is the 22 year old protagonist. He is the bass player for the band Sex Bob-Omb with his friends Stephen Stills and Kim Pine; he plays a Rickenbacker 4003 in the film."
    },
    {
        "Name": "Ramona Flowers",
        "ActorActress": "Mary Elizabeth Winstead",
        "Description": "Ramona Victoria Flowers is an American expatriate who lived in New York and now works as a 'Ninja delivery girl' for Amazon.ca in Canada. She is 24 years old and Scott's main love interest."
    },
    {
        "Name": "Wallace Wells",
        "ActorActress": "Kieran Culkin",
        "Description": "Wallace Wells is Scott Pilgrim's cool gay roommate; they met in college. Although he and Scott are just friends, they share a double bed because they cannot afford two beds, however, Wallace does show sexual interest in Scott on several occasions."
    },
    {
        "Name": "Knives Chau",
        "ActorActress": "Ellen Wong",
        "Description": "Knives Chau is a 17-year-old Chinese-Canadian catholic high school girl. When Knives dates Scott, she is happy-go-lucky, but when he cheated on her (initially 'forgetting' to break up with her), her personality drastically changes. "
    },
    {
        "Name": "Kim Pine",
        "ActorActress": "Alison Pill",
        "Description": "Kimberly 'Kim' Pine is Scott's high school friend and drummer of Sex Bob-omb. She is 23 years old and was Scott's first girlfriend, whom he 'saved' from Simon Lee."
    },
    {
        "Name": "Stephen Stills",
        "ActorActress": "Mark Webber",
        "Description": "Stephen Stills is the lead singer, guitarist and 'talent' of Sex Bob-omb. He is 23 years old and went to university with Scott."
    },
    {
        "Name": "Neil Nordegraf",
        "ActorActress": "Johnny Simmons",
        "Description": "Neil 'Young Neil' Nordegraf is Sex Bob-omb's biggest fan.He is very quiet and is most often seen just observing the dialogue of his friends and the events around him."
    },
    {
        "Name": "Stacey Pilgrim",
        "ActorActress": "Anna Kendrick",
        "Description": "Stacey Pilgrim is Scott's 19-year-old younger sister. She works at the same Second Cup with Julie Powers and is also friends with Ramona."
    },
    {
        "Name": "Julie Powers",
        "ActorActress": "Aubrey Plaza",
        "Description": "Julie is known to be snarky and mean, particularly to Scott.The only person she is likely to show any kindness to is Envy Adams, though she doesn't care much for Julie and tends to ignore her."
    },
    {
        "Name": "Envy Adams",
        "ActorActress": "Brie Larson",
        "Description": "Natalie V. 'Envy' Adams is Scott Pilgrim's ex-girlfriend who brutally dumped Scott in college prior to the events in the film. Now she is the lead singer of The Clash at Demonhead."
    },
    {
        "Name": "Matthew Patel",
        "ActorActress": "Satya Bhabha",
        "Description": "Matthew Patel is Ramona's first Evil Ex boyfriend and the first Evil Ex whom Scott battles. Ramona Flowers and he dated for only a week and a half, during which Ramona pretty much used Matthew and his mystical powers to ward off flocks of jocks interested in her."
    },
    {
        "Name": "Lucas Lee",
        "ActorActress": "Chris Evans",
        "Description": "Lucas Lee is Ramona Flowers' second evil ex. Lucas is a skateboarder turned sell-out actor who is shown as the star in a number of cheesy action movies."
    },
    {
        "Name": "Todd Ingram",
        "ActorActress": "Brandon Routh",
        "Description": "Todd Ingram is Ramona Flowers's third ex-boyfriend. He is a vegan and the bass player for The Clash at Demonhead."
    },
    {
        "Name": "Roxie Richter",
        "ActorActress": "Mae Whitman",
        "Description": "Roxie could move at near-ninja like speed, attaining a velocity where she became visible to the human eye only as a black blur."
    },
    {
        "Name": "Gideon Graves",
        "ActorActress": "Jason Schwartzman",
        "Description": "Gideon Gordon Graves is Ramona Flowers' seventh evil ex-boyfriend, the leader and founder of the League of Ramona's Evil Ex-Boyfriends, and the primary antagonist of the film."
    }
]